Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: All fields are public
ru: Все поля являются общедоступными

source: All functions should have side effects
ru: Все функции должны иметь побочные эффекты

source: All heap types
ru: Все типы кучи

source: All information about a module should be part of the module itself
ru: Вся информация о модуле должна быть частью самого модуля

source: All inheritance types
ru: Все виды наследования

source: All interfaces should have the same methods
ru: Все интерфейсы должны иметь одинаковые методы

source: all is always faster
ru: все всегда происходит быстрее

source: All objects must be public
ru: Все объекты должны быть общедоступными

source: All of the above
ru: Все вышеперечисленное

source: All of the above possible
ru: Все вышеперечисленное возможно

source: all only works with Vec
ru: все работает только с Vec

source: All properties of ()
ru: Все свойства ()

source: all requires true for all
ru: все требуется true for все

source: all returns true if the condition holds for all elements
ru: все возвраты true if условие выполняется for все элементы

source: All rules automatically
ru: Все правила автоматически

source: All services should be available through uniform notation regardless of implementation
ru: Все сервисы должны быть доступны через единую нотацию независимо от реализации

source: All terminate (loop/function/process), but idiomatic is break
ru: Все они завершаются (loop/function/process), но идиоматическим является break

source: All tests are ignored
ru: Все тесты игнорируются

source: All tests with add in the name run
ru: Все тесты с именем add in выполняются

source: All the same
ru: Все то же самое

source: All three
ru: Все три

source: All true
ru: Все true

source: All variants are public
ru: Все варианты являются публичными

source: Allowed, but may lead to double panic and abort
ru: Разрешено, но может привести к двойной панике и прерыванию

source: Allows "any" error type
ru: Допускает "любую" ошибку type

source: Allows an operation to be generic over any type while returning a single type
ru: Позволяет сделать операцию общей для любого type while , возвращающей один type

source: Allows copying types by value
ru: Позволяет копировать типы по значению

source: Allows copying without cloning
ru: Позволяет копировать без клонирования

source: Allows modifying the string
ru: Позволяет изменять строку

source: Allows mutation with &self
ru: Позволяет мутировать с помощью &ampself

source: Allows retry without cloning
ru: Позволяет повторить попытку без клонирования

source: Allows runtime behavior changes by composing different objects
ru: Позволяет изменять поведение во время выполнения программы путем компоновки различных объектов

source: Allows using * operator and reference coercions
ru: Позволяет использовать * оператор и коэрцитивы ссылок

source: Always
ru: Всегда

source: Always ()
ru: Всегда ()

source: Always a static method
ru: Всегда используйте метод static

source: Always asynchronous
ru: Всегда асинхронный

source: Always at the end of the block
ru: Всегда в конце блока

source: Always by &mut
ru: Всегда по &ampmut

source: Always by value
ru: Всегда по стоимости

source: Always clone strings
ru: Всегда клонируйте строки

source: Always combine related functionality
ru: Всегда объединяйте смежные функции

source: Always copy them to owned memory
ru: Всегда копируйте их в собственную память

source: Always faster than stack
ru: Всегда быстрее стека

source: Always for any error
ru: Всегда for любой ошибки

source: Always for fixed-size values
ru: Всегда for значения фиксированного размера

source: Always for futures
ru: Всегда for фьючерсы

source: Always gets copied
ru: Всегда копируется

source: Always global
ru: Всегда глобально

source: Always in release
ru: Всегда in

source: Always in static memory
ru: Всегда in static память

source: Always inserts 50
ru: Всегда вставляет 50

source: Always need Arc
ru: Всегда нужно Arc

source: Always panics
ru: Всегда паникует

source: Always possible
ru: Всегда можно

source: Always prints y
ru: Всегда печатает y

source: Always replaces if
ru: Всегда заменяет if

source: Always return
ru: Всегда return

source: Always return &'static String
ru: Всегда return &amp;'static String

source: Always returns i
ru: Всегда возвращает i

source: Always returns T
ru: Всегда возвращает T

source: Always slower
ru: Всегда медленнее

source: Always slower than static dispatch
ru: Всегда медленнее, чем на static

source: Always starts with lib
ru: Всегда начинается с lib

source: Always starts with pub
ru: Всегда начинается с pub

source: Always through move
ru: Всегда через move

source: Always UB
ru: Всегда UB

source: Always unwrap()
ru: Всегда разворачивайте()

source: Always use inheritance instead of composition
ru: Всегда use наследование вместо композиции

source: Always uses a default value
ru: Всегда использует значение по умолчанию

source: Always via *
ru: Всегда через *

source: Always works
ru: Всегда работает

source: An absolute path starts with crate or an external crate name
ru: Абсолютный путь начинается с crate или внешнего имени crate

source: An alias
ru: Псевдоним

source: An alias is created automatically
ru: Псевдоним создается автоматически

source: An alternative Stream
ru: Альтернативный поток

source: An alternative to Future
ru: Альтернатива будущему

source: An anonymous type implementing Future is created
ru: Создается анонимный type, реализующий Future

source: An array of char
ru: Массив char

source: An associated function doesn't take self. Called with ::
ru: Связанная функция не принимает self. Вызывается с помощью ::

source: An associative array
ru: Ассоциативный массив

source: An async function returns a type implementing Future with Output = T
ru: Функция async возвращает type, реализующую Future с Output = T

source: An asynchronous iterator
ru: Асинхронный итератор

source: An asynchronous object
ru: Асинхронный объект

source: An attack type
ru: Атака type

source: An attribute
ru: Атрибут

source: An empty file
ru: Пустой файл

source: An empty iterator
ru: Пустой итератор

source: An enum defines a type that can be one of several variants. It's an expressive alternative to structs when modeling choices
ru: Объект enum определяет объект type, который может быть одним из нескольких вариантов. Это выразительная альтернатива структурам при моделировании выбора

source: An enum for storing a bool
ru: На сайте enum for хранится bool

source: An enum representing presence or absence of a value
ru: enum, представляющий наличие или отсутствие значения

source: An enum stores the kind and the data together. Less code, more expressive
ru: На сайте enum вид и данные хранятся вместе. Меньше кода, больше выразительности

source: An enum variant
ru: Вариант enum

source: An enum with one variant
ru: Сайт enum с одним вариантом

source: An error handler
ru: Обработчик ошибок

source: An error handling pattern
ru: Шаблон обработки ошибок

source: An impl block implementing the Deserialize trait
ru: Блок impl, реализующий Deserialize trait

source: An instance of struct
ru: Экземпляр struct

source: An interface
ru: Интерфейс

source: An iterator with one element
ru: Итератор с одним элементом

source: An object combines data and procedures (methods/operations) that work with that data
ru: Объект объединяет данные и процедуры (методы/операции), которые работают с этими данными

source: An object should assume as little as possible about the structure of anything else
ru: Объект должен предполагать as мало as возможного о структуре чего-либо else

source: An OOP class
ru: Класс ООП

source: Analytics
ru: Аналитика

source: Anti-patterns
ru: Антипаттерны

source: Anti–data race rule - prevents races
ru: Правило борьбы с гонками данных - предотвращает гонки

source: any
ru: любой

source: Any
ru: Любой

source: Any binary crate
ru: Любой двоичный crate

source: Any byte offsets
ru: Любые смещения байтов

source: any checks if the closure returns true at least once
ru: при любой проверке if закрытие возвращается true хотя бы один раз

source: Any closure can be called at least once
ru: Любое закрытие может быть вызвано по крайней мере один раз

source: Any collection
ru: Любая коллекция

source: Any function inside impl
ru: Любая функция внутри impl

source: Any input error
ru: Любая ошибка ввода

source: Any nonzero
ru: Любой ненулевой

source: Any number
ru: Любое число

source: any requires true for all
ru: любой требует true for все

source: Any scalar
ru: Любой скаляр

source: Any structs
ru: Любые структуры

source: Any type with Copy
ru: Любой type с Copy

source: Any variable with reference &T
ru: Любая переменная со ссылкой &amp;T

source: Any wrapper over Vec<T>
ru: Любая обертка над Vec<T>

source: Anywhere
ru: В любом месте

source: Appends a char
ru: Добавляет char

source: Appends a single char
ru: Добавляет один char

source: Appends an &str
ru: Добавляет символ &ampstr

source: Appends an array
ru: Добавляет массив

source: Applies closure to each element
ru: Применяет закрытие к каждому элементу

source: Applies to ranges
ru: Применяется к диапазонам

source: apply and revert
ru: применять и возвращать

source: Arbitrary language choice
ru: Произвольный выбор языка

source: Arc only provides shared ownership
ru: Arc предоставляет только совместное владение

source: Arc uses atomic operations for thread safety
ru: Arc использует атомарные операции for безопасность потоков

source: Arc<Mutex<i32>>
ru: Arc&ltMutex&lt;i32&gt;&gt;

source: Arc<Mutex<i32>> and Arc::clone to each thread
ru: Arc&ltMutex&lt;i32&gt;&gt; и Arc::клонировать каждый поток

source: Arc<Mutex<T>>
ru: Arc&ltMutex<T>&gt

source: Arc<T> cannot be cloned
ru: Arc<T> не может быть клонирован

source: Arc<T> is slower and forbidden
ru: Arc<T> медленнее и запрещено

source: Arc<T> is thread-safe (atomic counter), Rc<T> is not
ru: Arc<T> является потокобезопасным (атомарный счетчик), Rc<T> не

source: Are destructors guaranteed to run in all cases?
ru: Гарантируется ли выполнение деструкторов in во всех случаях?

source: Are newtypes zero-cost abstractions?
ru: Являются ли новые типы абстракциями с нулевыми затратами?

source: Are Rust futures lazy?
ru: Ленивы ли фьючерсы Rust?

source: Are struct and enum in Rust objects according to Gang of Four definition?
ru: Являются ли struct и enum in объектами Rust в соответствии с определением Gang of Four?

source: Are Vec<isize> and Vec<char> the same type in Rust?
ru: Это Vec&lt;isize&gt; и Vec&lt;char&gt; - это один и тот же type in Rust?

source: Are you sure you want to delete the data?
ru: Вы уверены, что хотите удалить данные?

source: area(rect)
ru: площадь(прямоугольник)

source: Array length
ru: Длина массива

source: array![]
ru: массив![]

source: As boolean values
ru: В виде булевых значений

source: As complete Rust enums
ru: Как полные перечисления Rust

source: As integer code only
ru: Только как целочисленный код

source: As integer code with a string error message for details
ru: В виде целочисленного кода со строковым сообщением об ошибке for подробнее

source: As it parses items from the input
ru: По мере того как он разбирает элементы из входных данных

source: As JSON strings
ru: В виде строк JSON

source: as lets you rename an import
ru: as позволяет переименовать импорт

source: as lets you rename, e.g., IoResult
ru: as позволяет переименовывать, например, IoResult

source: As strings
ru: Как струны

source: As void pointers
ru: Как указатели на пустоту

source: assert_eq! prints both values on mismatch
ru: assert_eq! выводит оба значения при несовпадении

source: assert_ne! passes if values are different
ru: assert_ne! проходит if значения разные

source: assert!(cond) checks a boolean condition, on false → panic
ru: assert!(cond) проверяет булево условие, на false → panic

source: Assignment
ru: Задание

source: Assignment without mut
ru: Назначение без mut

source: Associated type can only be specified once per type
ru: Ассоциированный type может быть указан только один раз в type

source: Associated type is a placeholder that implementor specifies with concrete type
ru: Ассоциированный type - это место, которое исполнитель определяет с помощью конкретного type

source: Associated type only for Iterator
ru: Ассоциированный type только for Итератор

source: AST and AST
ru: АСТ и АСТ

source: Async can structure cooperative multitasking even for CPU-bound workflows
ru: Async может структурировать совместную многозадачность даже for процессорных рабочих процессов

source: Async code is transformed into a state machine spanning await points
ru: Асинхронный код преобразуется в машину состояний, охватывающую await точек

source: Async functions
ru: Асинхронные функции

source: Async functions can't return values
ru: Асинхронные функции не могут размещать значения по адресу return

source: Async recv is faster
ru: Async recv быстрее

source: Async recv is nonblocking and yields a future
ru: Async recv является неблокируемым и выдает будущее

source: Async recv returns a future you must await
ru: Async recv возвращает будущее, которое вы должны await

source: Async shines for handling many concurrent events
ru: Async сияет for, обрабатывая множество одновременных событий

source: Asynchronous queue
ru: Асинхронная очередь

source: Asynchronous task
ru: Асинхронная задача

source: At any moment there is exactly one owner
ru: В любой момент времени существует ровно один владелец

source: At each await, the runtime can pause the task and switch to others
ru: На каждом await время выполнения может приостановить задачу и переключиться на другую

source: At most one
ru: Не более одного

source: At program exit
ru: При завершении программы

source: Atomic counter
ru: Атомный счетчик

source: Atomic types for lock-free operations
ru: Атомарные типы for операции без блокировки

source: Attribute-like macros allow creating custom attributes for functions, struct, and other elements
ru: Атрибутоподобные макросы позволяют создавать пользовательские атрибуты for функций, struct, и других элементов

source: Auto type promotion
ru: Авто type продвижение

source: Auto-implemented when safe
ru: Автоматическое выполнение, если это безопасно

source: Auto-return
ru: Авто-return

# automated_tests_link
source: https://doc.rust-lang.org/book/ch11-00-testing.html
ru: https://doc.rust-lang.ru/book/ch11-00-testing.html

source: Automatic alias
ru: Автоматический псевдоним

source: Automatic cloning
ru: Автоматическое клонирование

source: Automatic code generation
ru: Автоматическая генерация кода

source: Automatic conversion
ru: Автоматическое преобразование

source: Automatic coverage of all cases
ru: Автоматический охват всех случаев

source: Automatic drop - Rust uses RAII
ru: Автоматическое падение - Rust использует RAII

source: Automatic trait for types with known size at compile time
ru: Автоматическое trait for типов с известным размером во время компиляции

source: Automatic type casting
ru: Автоматическое литье type

source: Automatic unsafe
ru: Автоматический unsafe

source: Automatically
ru: Автоматически

source: Automatically becomes mut
ru: Автоматически становится mut

source: Automatically becomes String
ru: Автоматически становится String

source: Automatically by compiler
ru: Автоматически компилятором

source: Automatically by the compiler
ru: Автоматически компилятором

source: Automatically creates getters
ru: Автоматическое создание геттеров

source: Automatically for some functions
ru: Автоматически for некоторые функции

source: Automatically makes all fields mut
ru: Автоматически делает все поля mut

source: Automatically propagates
ru: Автоматически распространяется

source: Automatically when adding
ru: Автоматически при добавлении

source: Automatically wraps in Result
ru: Автоматическое обертывание in Result

source: await pauses a future and lets the runtime schedule other tasks
ru: await приостанавливает выполнение будущего и позволяет программе запланировать другие задачи

source: Awaits both futures and returns a tuple of results
ru: Ожидает оба фьючерса и возвращает кортеж результатов

source: b and c
ru: b и c

source: Back to menu
ru: Меню

source: Background GC
ru: Фоновый ГК

source: Base trait in hierarchy
ru: База trait in иерархия

source: Because drafts are empty
ru: Потому что черновики - это пустота

source: Because impl hides them
ru: Потому что impl скрывает их

source: Because it allows changing T through immutable wrapper Arc<Mutex<T>> while following locking protocol
ru: Потому что он позволяет изменять T через неизменяемую обертку Arc&ltMutex<T>&gt; while, следуя протоколу блокировки

source: Because it checks borrows at runtime, which is not thread-safe
ru: Потому что он проверяет заимствования во время выполнения, что небезопасно для потоков

source: Because it has no Drop
ru: Потому что у него нет Капли

source: Because it implements Copy
ru: Поскольку она реализует Copy

source: Because it uses RefCell
ru: Поскольку в нем используется RefCell

source: Because it's deprecated
ru: Потому что он устарел

source: Because it's expensive
ru: Потому что это дорого

source: Because it's not Clone
ru: Потому что это не Clone

source: Because it's slow
ru: Потому что это медленно

source: Because it's slower
ru: Потому что это медленнее

source: Because Mutex<T> is always mut
ru: Потому что Mutex<T> всегда mut

source: Because of Deref
ru: Из-за Дерефа

source: Because of panics
ru: Из-за паники

source: Because of RefCell
ru: Из-за RefCell

source: Because of strong reference cycles in Rc
ru: Из-за сильных циклов ссылок in Rc

source: Because Rc<T> is not Clone
ru: Потому что Rc<T> не Clone

source: Because Rc<T> is not Send
ru: Потому что Rc<T> не Отправить

source: Because Rc<T> is not Sync and has no Drop
ru: Потому что Rc<T> не Sync и не имеет Drop

source: Because str: Deref<String>
ru: Потому что str: Deref&lt;String&gt;

source: Because String: AsRef<str> and it's automatic
ru: Потому что String: AsRef&lt;str&gt; и это автоматически

source: Because String: Deref<Target = str>
ru: Потому что String: Deref&lt;Цель = str&gt;

source: Because T may not be Copy
ru: Потому что T может быть не Copy

source: Because there can be multiple owners, and unique mutation isn't safe
ru: Потому что владельцев может быть несколько, а уникальная мутация небезопасна

source: Becomes "2"
ru: Становится "2"

source: Becomes 0
ru: Становится 0

source: Becomes 2
ru: Становится 2

source: Becomes a string
ru: Становится строкой

source: Becomes Option
ru: Становится Option

source: Before parsing starts
ru: Перед началом разбора

source: Before the expression
ru: Перед выражением

source: Begin my path
ru: Начать изучение

source: Behaves like assignment: move or copy
ru: Ведет себя как назначение: move или копирование

source: Behavior should be unpredictable
ru: Поведение должно быть непредсказуемым

source: Better optimization
ru: Лучшая оптимизация

source: Better performance
ru: Лучшая производительность

source: Better type safety
ru: Повышенная безопасность type

source: Binary and library
ru: Бинарные и библиотечные

source: Binary literal
ru: Двоичный литерал

source: Binary only
ru: Только двоичный

source: Binary to decimal
ru: Перевод из двоичной системы в десятичную

source: Binds value to variable while testing pattern
ru: Привязывает значение к переменной while шаблон тестирования

source: Bitwise OR
ru: Побитовое ИЛИ

source: Block is an expression, returns y+3
ru: Блок - выражение, возвращает y+3

source: Blocks all process threads
ru: Блокирует все потоки процесса

source: Blocks current thread
ru: Блокирует текущий поток

source: Blocks forever
ru: Блоки навсегда

source: Blocks the current task
ru: Блокирует текущее задание

source: Blocks the thread until the operation finishes
ru: Блокирует поток до завершения операции

source: bool implements Copy. Simple types are copied
ru: bool реализует Copy. Простые типы копируются

source: Boolean literal:
ru: Булевский литерал:

source: Borrow checker issue
ru: Проблема с контролером займов

source: Borrow checker issues with large structs
ru: Проблемы с проверкой заимствований при работе с большими структурами

source: Borrowing
ru: Займы

source: Borrowing conflict - violates rules
ru: Конфликт с заимствованием - нарушение правил

source: Borrowing rules enforced at runtime
ru: Правила заимствования, применяемые во время выполнения

source: Borrows the value
ru: Заимствует значение

source: Both are non-blocking
ru: Оба варианта являются неблокируемыми

source: Both are shared owners
ru: Оба являются общими владельцами

source: Both are single owners
ru: Оба являются единоличными владельцами

source: Both block
ru: Оба блока

source: Both create a String from a literal
ru: Оба создают String из литерала

source: Both equally
ru: Оба в равной степени

source: Both express the same thing
ru: Оба выражают одно и то же

source: Both fields list and average are private to guarantee correctness of the average value
ru: Оба поля list и average являются приватными, чтобы гарантировать корректность среднего значения

source: Both remain accessible
ru: Оба остаются доступными

source: Both return
ru: Оба return

source: Both syntaxes valid; block comments nest
ru: Оба синтаксиса действительны; блок комментариев гнездится

source: Both the stack pointer and heap data are freed
ru: Освобождаются указатель стека и данные кучи

source: Both walk data structures, but Fold creates new structures
ru: Обе структуры данных работают с данными, но Fold создает новые структуры

source: Bottom line: why use enum + match?
ru: Итог: зачем use enum + match?

source: Bottom line: why use structs?
ru: В итоге: зачем нужны use структуры?

source: bound T = PartialOrd
ru: ограничение T = PartialOrd

source: Bounds checked at runtime
ru: Границы проверяются во время выполнения

source: Bounds-checked indexing → panic
ru: Индексирование с проверкой границ → паника

source: Box breaks infinite recursion in size (e.g., in Cons(i32, Box<List>))
ru: Box прерывает бесконечную рекурсию in размера (например, in Cons(i32, Box<List>))

source: Box implements Deref
ru: Box реализует Deref

source: Box stores a "thin" pointer to a value on the heap
ru: Box хранит "тонкий" указатель на значение в куче

source: Box supports dynamically sized types
ru: Box поддерживает типы с динамическими размерами

source: Box::pin produces a pinned heap allocation, useful for dynamic futures
ru: Box::pin создает распределение кучи с булавками, полезное for динамических фьючерсов

source: Box<dyn Draw> is a trait object for any type in Box implementing Draw
ru: Box&lt;dyn Draw&gt; - это объект trait for любой type in Box реализующий Draw

source: Box<dyn Fn> is needed to work with different closures of one trait as one type
ru: Box&lt;dyn Fn&gt; необходим для работы с различными закрытиями одного trait as одного type

source: Box<i32>
ru: Box&lt;i32&gt

source: Branch types must match
ru: Типы отделений должны match

source: break value; in loop:
ru: break значение; in loop :

source: Breaking a large struct into smaller ones allows independent borrowing of each component
ru: Разбиение большого struct на более мелкие позволяет независимо заимствовать каждый компонент

source: Breaks struct into separate variables
ru: Разбивает struct на отдельные переменные

source: Breaks the whole loop
ru: Разбивает весь loop

source: Bridges the data type and format-specific implementations
ru: Мост между данными type и реализациями, ориентированными на конкретные форматы

source: Brings in an external crate
ru: Приносит in внешний crate

source: Brings in std
ru: Приносит in std

source: build_* functions
ru: функции build_*
